$Start ::= <声明串> $End

<声明串> ::= <声明>
<声明串> ::= <声明串> <声明>

<声明> ::= int <ID> <声明类型>
<声明> ::= void <ID> <函数声明>

<声明类型> ::= <变量声明>
<声明类型> ::= <函数声明>

<变量声明> ::=  ;

<函数声明> ::= ( <形参> ) <语句块>

<形参> ::= <参数列表>
<形参> ::= void

<参数列表> ::= <参数>
<参数列表> ::= <参数列表> , <参数>

<参数> ::= int <ID>

<语句块> ::= { <内部声明> <语句串> }

<内部声明> ::= $Empty
<内部声明> ::= <内部变量声明>
<内部声明> ::= <内部声明> ; <内部变量声明>

<内部变量声明> ::= int <ID>

<语句串> ::= <语句>
<语句串> ::= <语句串> <语句>

<语句> ::= <if语句>
<语句> ::= < while语句>
<语句> ::= <return语句>
<语句> ::= <赋值语句>

<赋值语句> ::= ID = <表达式> ;

<return语句> ::= return
<return语句> ::= return <表达式>

<while语句> ::= while ( <表达式> ) <语句块>

<if语句> ::= if ( <表达式> ) <语句块>
<if语句> ::= if ( <表达式> ) <语句块> else <语句块>

<表达式> ::= <加法表达式>
<表达式> ::= <表达式> <比较运算符>?<加法表达式>

<比较运算符> ::= <
<比较运算符> ::= <=
<比较运算符> ::= >
<比较运算符> ::= >=
<比较运算符> ::= ==
<比较运算符> ::= !=

<加法表达式> ::= <项>
<加法表达式> ::= <加法表达式> + <项>
<加法表达式> ::= <加法表达式> - <项>

<项> ::= <因子>
<项> ::= <项> * <因子>
<项> ::= <项> / <因子>

<因子> ::= Number
<因子> ::= ( <表达式> )
<因子> ::= ID FTYPE

FTYPE ::= <call>
FTYPE ::= $Empty

<call> ::= ( <实参> )

<实参> ::= <实参列表>
<实参> ::= $Empty

<实参列表> ::= <表达式>
<实参列表> ::= <实参列表> , <表达式>